Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F412G-DISCO.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                            |FMPI2C1|I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |SPI4 |SPI5 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |JOY_SEL [MT008-A_CENTER]               |       |    |    |    |     |     |     |     |     |      |      |      |      |*IN0 |+TIM5_CH1 *TIM2_CH1                       |          |    |          |           
PA1 , // |                                       |       |    |    |    |     |     |     |+MOSI|     |      |      |      |      |*IN1 |+TIM5_CH2 *TIM2_CH2                       |          |    |          |           
PA2 , // |STLINK_RX [STLINK_U2_RX]               |       |    |    |    |     |     |     |     |     |      |*TX   |      |      |*IN2 |+TIM5_CH3 +TIM9_CH1 *TIM2_CH3             |          |    |          |           
PA3 , // |STLINK_TX [STLINK_U2_TX]               |       |    |    |    |     |     |     |     |     |      |*RX   |      |      |*IN3 |+TIM5_CH4 +TIM9_CH2 *TIM2_CH4             |          |    |          |           
PA4 , // |CODEC_I2S3_WS [WM8994ECS/R_LRCLK1]     |       |    |    |    |     |     |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |                                       |       |    |    |    |*SCK |     |     |     |     |      |      |      |      |*IN5 |*TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |                                       |       |    |    |    |*MISO|     |     |     |     |      |      |      |      |*IN6 |*TIM3_CH1 +TIM13_CH1                      |          |*CMD|          |           
PA7 , // |                                       |       |    |    |    |*MOSI|     |     |     |     |      |      |      |      |*IN7 |*TIM1_CH1N +TIM8_CH1N *TIM3_CH2 +TIM14_CH1|          |    |          |           
PA8 , // |M2_CKIN                                |       |    |    |*SCL|     |     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |+D1 |          |           
PA9 , // |USB_OTGFS_VBUS                         |       |    |    |    |     |     |     |     |     |*TX   |      |      |      |     |+TIM1_CH2                                 |          |*D2 |          |           
PA10, // |USB_OTGFS_ID                           |       |    |    |    |     |     |     |     |+MOSI|*RX   |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PA11, // |USB_OTGFS_DM                           |       |    |    |    |     |     |     |+MISO|     |      |      |      |+TX   |     |+TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |USB_OTGFS_DP                           |       |    |    |    |     |     |     |     |+MISO|      |      |      |+RX   |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |SWDIO                                  |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |SWCLK                                  |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |                                       |       |    |    |    |     |     |     |     |     |+TX   |      |      |      |     |+TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |                                       |       |    |    |    |     |     |     |     |+SCK |      |      |      |      |*IN8 |*TIM8_CH2N *TIM3_CH3 *TIM1_CH2N           |          |    |          |           
PB1 , // |DFSDM_DATIN0 [MP34DT01TR_DOUT]         |       |    |    |    |     |     |     |     |     |      |      |      |      |*IN9 |*TIM3_CH4 *TIM1_CH3N *TIM8_CH3N           |          |    |          |           
PB2 , // |QSPI_CLK [N25Q128A13EF840F_C]          |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB3 , // |SWO                                    |+SDA   |+SDA|+SDA|    |+SCK |     |+SCK |     |     |+RX   |      |      |      |     |+TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |CODEC_I2S3ext_SD [WM8994ECS/R_ACDAT1]  |       |    |    |+SDA|+MISO|     |+MISO|     |     |      |      |      |      |     |+TIM3_CH1                                 |          |+D0 |          |*JTRST     
PB5 , // |CODEC_I2S3_SD [WM8994ECS/R_DACDAT1]    |       |    |    |    |+MOSI|     |+MOSI|     |     |      |      |      |      |     |+TIM3_CH2                                 |          |+D3 |          |           
PB6 , // |I2C1_SCL [WM8994ECS/R_SCLK]            |       |*SCL|    |    |     |     |     |     |     |+TX   |      |      |      |     |+TIM4_CH1                                 |          |+D0 |          |           
PB7 , // |I2C1_SDA [WM8994ECS/R_SDA]             |       |*SDA|    |    |     |     |     |     |     |+RX   |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PB8 , // |                                       |       |+SCL|    |+SDA|     |     |     |     |+MOSI|      |      |      |      |     |+TIM10_CH1 +TIM4_CH3                      |          |*D4 |          |           
PB9 , // |I2C2_SDA                               |       |+SDA|+SDA|    |     |     |     |     |     |      |      |      |      |     |+TIM11_CH1 +TIM4_CH4                      |          |*D5 |          |           
PB10, // |I2C2_SCL                               |+SCL   |+SCL|+SCL|    |     |*SCK |     |     |     |      |      |*TX   |      |     |+TIM2_CH3                                 |          |*D7 |          |           
PB11, // |M2_CKIN                                |       |    |+SDA|    |     |     |     |     |     |      |      |+RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |CODEC_I2S3_SCK [WM8994ECS/R_BCLK1]     |       |    |    |    |     |     |*SCK |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |                                       |       |    |    |    |     |+SCK |     |+SCK |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PB14, // |                                       |+SDA   |+SDA|    |    |     |+MISO|     |     |     |      |      |      |      |     |+TIM8_CH2N +TIM1_CH2N *TIM12_CH1          |          |*D6 |          |           
PB15, // |                                       |+SCL   |+SCL|    |    |     |+MOSI|     |     |     |      |      |      |      |     |+TIM1_CH3N +TIM8_CH3N *TIM12_CH2          |          |*CK |          |           
PC0 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |*IN11|                                          |          |    |          |           
PC2 , // |DFSDM_CKOUT [MP34DT01TR_CLK]           |       |    |    |    |     |*MISO|     |     |     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |                                       |       |    |    |    |     |*MOSI|     |     |     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |*RX   |      |*IN15|                                          |          |    |          |           
PC6 , // |                                       |+SCL   |+SCL|    |    |     |     |     |     |     |      |      |      |*TX   |     |*TIM8_CH1 +TIM3_CH1                       |          |+D6 |          |           
PC7 , // |CODEC_I2S3_MCK [WM8994ECS/R_MCLK1]     |+SDA   |+SDA|    |    |     |+SCK |     |     |     |      |      |      |*RX   |     |+TIM3_CH2 *TIM8_CH2                       |          |+D7 |          |           
PC8 , // |uSD_D0                                 |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM8_CH3 +TIM3_CH3                       |          |*D0 |          |           
PC9 , // |uSD_D1                                 |       |    |    |*SDA|     |     |     |     |     |      |      |      |      |     |+TIM3_CH4 *TIM8_CH4                       |          |*D1 |          |           
PC10, // |uSD_D2                                 |       |    |    |    |     |     |+SCK |     |     |      |      |+TX   |      |     |                                          |          |+D2 |          |           
PC11, // |uSD_D3                                 |       |    |    |    |     |     |*MISO|     |     |      |      |+RX   |      |     |                                          |          |*D3 |          |           
PC12, // |uSD_CLK                                |       |    |    |    |     |     |*MOSI|     |     |      |      |      |      |     |                                          |          |+CK |          |           
PC13, // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |D2                                     |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD1 , // |D3                                     |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |uSD_CMD                                |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |+CMD|          |           
PD3 , // |uSD_DETECT                             |       |    |    |    |     |+SCK |     |     |     |      |      |      |      |     |                                          |          |    |          |+TRACED1   
PD4 , // |FMC_NOE                                |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |FMC_NWE                                |       |    |    |    |     |     |     |     |     |      |+TX   |      |      |     |                                          |          |    |          |           
PD6 , // |                                       |       |    |    |    |     |     |+MOSI|     |     |      |+RX   |      |      |     |                                          |          |    |          |           
PD7 , // |FMC_NE1                                |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |D13                                    |       |    |    |    |     |     |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |D14                                    |       |    |    |    |     |     |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |D15                                    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |LCD_RESET                              |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |                                       |+SCL   |+SCL|    |    |     |     |     |     |     |      |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PD13, // |                                       |+SDA   |+SDA|    |    |     |     |     |     |     |      |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PD14, // |D0                                     |+SCL   |+SCL|    |    |     |     |     |     |     |      |      |      |      |     |*TIM4_CH3                                 |          |    |          |           
PD15, // |D1                                     |+SDA   |+SDA|    |    |     |     |     |     |     |      |      |      |      |     |*TIM4_CH4                                 |          |    |          |           
PE0 , // |LED1 [Green]                           |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |LED2 [Orange]                          |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |LED3 [Red]                             |       |    |    |    |     |     |     |*SCK |*SCK |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |LED4 [Blue]                            |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |DFSDM_DATIN3 [MP23DB01MM_DOUT]         |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |                                       |       |    |    |    |     |     |     |*MISO|*MISO|      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |                                       |       |    |    |    |     |     |     |*MOSI|*MOSI|      |      |      |      |     |*TIM9_CH2                                 |          |    |          |*TRACED3   
PE7 , // |D4                                     |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |D5                                     |       |    |    |    |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |D6                                     |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PE10, // |D7                                     |       |    |    |    |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |D8                                     |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PE12, // |D9                                     |       |    |    |    |     |     |     |+SCK |+SCK |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |D10                                    |       |    |    |    |     |     |     |+MISO|+MISO|      |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PE14, // |D11                                    |       |    |    |    |     |     |     |+MOSI|+MOSI|      |      |      |      |     |*TIM1_CH4                                 |          |    |          |           
PE15, // |D12                                    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF0 , // |A0                                     |       |    |*SDA|    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF1 , // |                                       |       |    |*SCL|    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF2 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF3 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM5_CH1                                 |          |    |          |           
PF4 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM5_CH2                                 |          |    |          |           
PF5 , // |LCD_BLCTRL [STT5N2VH5_Gate]            |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM5_CH3                                 |          |    |          |           
PF6 , // |QSPI_BK1_IO3 [N25Q128A13EF840F_DQ3]    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM10_CH1                                |          |    |          |+TRACED0   
PF7 , // |QSPI_BK1_IO2 [N25Q128A13EF840F_DQ2]    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM11_CH1                                |          |    |          |+TRACED1   
PF8 , // |QSPI_BK1_IO0 [N25Q128A13EF840F_DQ0]    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM13_CH1                                |          |    |          |           
PF9 , // |QSPI_BK1_IO1 [N25Q128A13EF840F_DQ1]    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM14_CH1                                |          |    |          |           
PF10, // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |*TIM5_CH4                                 |          |    |          |           
PF11, // |EXT_RESET                              |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF12, // |CTP_RST                                |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF13, // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF14, // |JOY_RIGHT [MT008-A_RIGHT]              |*SCL   |*SCL|    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF15, // |JOY_LEFT [MT008-A_LEFT]                |*SDA   |*SDA|    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG0 , // |JOY_UP [MT008-A_UP]                    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG1 , // |JOY_DOWN [MT008-A_DOWN]                |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG2 , // |CODEC_INT [WM8994ECS/R_ADCLRCLK1/GPIO1]|       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG3 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG4 , // |LCD_TE                                 |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG5 , // |CTP_INT                                |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG6 , // |QSPI_BK1_NCS [N25Q128A13EF840F_S]      |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG7 , // |USB_OTGFS_OVRCR [STMPS2141STR_FAULT]   |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG8 , // |USB_OTGFS_PPWR_EN [STMPS2141STR_EN]    |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG9 , // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |+RX   |     |                                          |          |    |          |           
PG10, // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG11, // |                                       |       |    |    |    |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
